       IDENTIFICATION DIVISION. 
       PROGRAM-ID. COBSHL02.
       ENVIRONMENT DIVISION. 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

       PROGRAM-DONE.
           STOP RUN.
