       IDENTIFICATION DIVISION.
       PROGRAM-ID. 
       ENVIRONMENT DIVISION. 
       DATA DIVISION. 
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "This program contains four DIVISIONS,".
           DISPLAY "three PARAGRAPHS".
           DISPLAY "and four SENTENCES".
       PROGRAM-DONE.
           STOP RUN.
