       IDENTIFICATION DIVISION. 
       PROGRAM-ID. CONST.
       ENVIRONMENT DIVISION. 
       DATA DIVISION. 
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Hello world".
           DISPLAY 55.
           DISPLAY 12.607.
       PROGRAM-DONE.
           STOP RUN.
